### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # helm_release.onp_cluster_argocd will be updated in-place
!   resource "helm_release" "onp_cluster_argocd" {
        id                         = "argocd"
        name                       = "argocd"
!       status                     = "failed" -> "deployed"
        # (27 unchanged attributes hidden)
    }

  # kubernetes_namespace.newrelic will be created
+   resource "kubernetes_namespace" "newrelic" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "newrelic"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.newrelic_credentials will be created
+   resource "kubernetes_secret" "newrelic_credentials" {
+       data                           = (sensitive value)
+       id                             = (known after apply)
+       type                           = "Opaque"
+       wait_for_service_account_token = true

+       metadata {
+           generation       = (known after apply)
+           name             = "newrelic-credentials"
+           namespace        = "newrelic"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>